Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The Yocto Project supports several methods by which you can set up this cross-development environment. These methods include downloading pre-built SDK installers or building and installing your own SDK installer.
it_it: Yocto Project supporta diversi metodi per configurare questo ambiente di sviluppo cross-development. Questi metodi includono il download di programmi di installazione SDK precompilati o la creazione e installazione di un programma di installazione SDK personalizzato.

source: The Yocto Project supports two different cross-development toolchains:
it_it: Yocto Project supporta due diverse toolchain di cross-development:

source: The Yocto Project team has tried to keep the details of the implementation hidden in the :ref:`ref-classes-sstate` class. From a user's perspective, adding shared state wrapping to a task is as simple as this :ref:`ref-tasks-deploy` example taken from the :ref:`ref-classes-deploy` class::
it_it: Il team di Yocto Project ha cercato di mantenere nascosti i dettagli dell'implementazione nella classe :ref:`ref-classes-sstate`. Dal punto di vista dell'utente, aggiungere il wrapping dello "shared state" [stato condiviso] a un task è semplice come nell'esempio :ref:`ref-tasks-deploy` tratto dalla classe :ref:`ref-classes-deploy` class::

source: The Yocto Project team maintains complete source repositories for all Yocto Project files at :yocto_git:`/`. This web-based source code browser is organized into categories by function such as IDE Plugins, Matchbox, Poky, Yocto Linux Kernel, and so forth. From the interface, you can click on any particular item in the "Name" column and see the URL at the bottom of the page that you need to clone a Git repository for that particular item. Having a local Git clone of these repositories allows you to make changes, contribute to the history, and ultimately enhance the Yocto Project's tools, Board Support Packages, and so forth.
it_it: Il team di Yocto Project mantiene repository di codice sorgente completi per tutti i file di Yocto Project all'indirizzo :yocto_git:`/`. Questo browser di codice sorgente basato sul web è organizzato in categorie per funzione, come plugin IDE, Matchbox, Poky, kernel Linux Yocto e così via. Dall'interfaccia, è possibile cliccare su qualsiasi elemento nella colonna "Name" e visualizzare l'URL in fondo alla pagina necessario per clonare un repository Git per quell'elemento specifico. Avere una copia locale di questi repository Git consente di apportare modifiche, contribuire alla cronologia e, in definitiva, migliorare gli strumenti di Yocto Project, i pacchetti di supporto per le schede (BSP) e altro ancora.

source: The Yocto Project uses a `Patchwork instance <https://patchwork.yoctoproject.org/>`__ to track the status of patches submitted to the various mailing lists and to support automated patch testing. Each submitted patch is checked for common mistakes and deviations from the expected patch format and submitters are notified by ``patchtest`` if such mistakes are found. This process helps to reduce the burden of patch review on maintainers.
it_it: Yocto Project utilizza `un'istanza di Patchwork <https://patchwork.yoctoproject.org/>`__ per monitorare lo stato delle patch inviate alle varie mailing list e per supportare il test automatico delle patch. Ogni patch inviata viene controllata per individuare errori comuni e deviazioni dal formato previsto, e gli autori vengono avvisati da ``patchtest`` se vengono rilevati tali errori. Questo processo contribuisce a ridurre il carico di lavoro dei manutentori per la revisione delle patch.

source: The Yocto Project's "Layer Model" is a development model for embedded and IoT Linux creation that distinguishes the Yocto Project from other simple build systems. The Layer Model simultaneously supports collaboration and customization. Layers are repositories that contain related sets of instructions that tell the :term:`OpenEmbedded Build System` what to do. You can collaborate, share, and reuse layers.
it_it: Il Modello a Layer di Yocto Project è un modello di sviluppo per la creazione di applicazioni Linux embedded e IoT che distingue Yocto Project da altri semplici sistemi di build. Il modello a layer supporta simultaneamente la collaborazione e la personalizzazione. I layer sono repository che contengono insiemi di istruzioni correlate che indicano all':term:`OpenEmbedded Build System` cosa fare. È possibile collaborare, condividere e riutilizzare i layer.

source: The Yocto Project's main :yocto_ab:`Autobuilder <>` publicly tests each Yocto Project release's code in the :oe_git:`openembedded-core </openembedded-core>`, :yocto_git:`meta-yocto </meta-yocto>` and :oe_git:`bitbake </bitbake>` repositories. The testing occurs for both the current state of the "master" branch and also for submitted patches. Testing for submitted patches usually occurs in the "master-next" branch in the :oe_git:`openembedded-core </openembedded-core>`, :yocto_git:`meta-yocto </meta-yocto>` and :oe_git:`bitbake </bitbake>` repository.
it_it: Il principale strumento di compilazione automatica (:yocto_ab:`Autobuilder <>`) di Yocto Project testa pubblicamente il codice di ogni release di Yocto Project nei repository :oe_git:`openembedded-core </openembedded-core>`, :yocto_git:`meta-yocto </meta-yocto>` e :oe_git:`bitbake </bitbake>`. I test vengono eseguiti sia per lo stato corrente del branch "master" sia per le patch inviate. I test per le patch inviate vengono solitamente eseguiti nel ramo "master-next" nei repository :oe_git:`openembedded-core </openembedded-core>`, :yocto_git:`meta-yocto </meta-yocto>` e :oe_git:`bitbake </bitbake>`.

source: The Yocto Project/OpenEmbedded security team coordinates the work on security subjects in the project. All general discussion takes place publicly. The Security Team only uses confidential communication tools to deal with private vulnerability reports before they are released.
it_it: Il team di sicurezza di Yocto Project/OpenEmbedded coordina il lavoro sulle tematiche di sicurezza all'interno del progetto. Tutte le discussioni generali si svolgono pubblicamente. Il Security Team utilizza strumenti di comunicazione riservati esclusivamente per gestire le segnalazioni di vulnerabilità private prima della loro pubblicazione.

source: The Yocto documentation repository is hosted at :yocto_git:`/yocto-docs`.
it_it: Il repository della documentazione di Yocto è ospitato in :yocto_git:`/yocto-docs`.

source: The Yocto project delivers minor (point) releases on an unscheduled basis and are usually driven by the accumulation of enough significant fixes or enhancements to the associated major release. Some example past point releases are:
it_it: Yocto project rilascia versioni minori (point) in modo non programmato, solitamente in seguito all'accumulo di un numero sufficiente di correzioni o miglioramenti significativi alla versione principale associata. Alcuni esempi di versioni minori precedenti sono:

source: The ``--cover-from-description=auto`` option makes ``git format-patch`` use the first paragraph of the branch description as the cover letter title. Another possibility, which is easier to remember, is to pass only the ``--cover-letter`` option, but you will have to edit the subject line manually every time you generate the patches.
it_it: L'opzione ``--cover-from-description=auto`` fa sì che ``git format-patch`` utilizzi il primo paragrafo della descrizione del branch come titolo della lettera di presentazione. Un'altra possibilità, più facile da ricordare, è quella di passare solo l'opzione ``--cover-letter``, ma si dovrà modificare manualmente l'oggetto ogni volta che si generano le patch.

source: The ``-s`` option of ``git commit`` adds a "Signed-off-by:" line to your commit message. There is the same requirement for contributing to the Linux kernel. Adding such a line signifies that you, the submitter, have agreed to the `Developer's Certificate of Origin 1.1 <https://www.kernel.org/doc/html/latest/process/submitting-patches.html#sign-your-work-the-developer-s-certificate-of-origin>`__ as follows:
it_it: L'opzione ``-s`` di ``git commit`` aggiunge la riga "Signed-off-by:" al messaggio di commit. Lo stesso requisito vale per chi contribuisce al kernel Linux. L'aggiunta di tale riga indica che l'utente che invia la patch ha accettato il `Developer's Certificate of Origin 1.1 <https://www.kernel.org/doc/html/latest/process/submitting-patches.html#sign-your-work-the-developer-s-certificate-of-origin>`__ come segue:

source: The ``License-Update:`` tag is not needed for commits which fix incorrect license data in our metadata (for an example see OE-Core commit :oecore_rev:`6c8b76d240d2457578a58787121bc5873d724ee2`).
it_it: Il tag ``License-Update:`` non è necessario per i commit che correggono dati di licenza errati nei nostri metadati (per un esempio, vedere il commit OE-Core :oecore_rev:`6c8b76d240d2457578a58787121bc5873d724ee2`).

source: The ``PowerTools/CRB`` repo provides additional packages such as ``rpcgen`` and ``texinfo``.
it_it: Il repository ``PowerTools/CRB`` fornisce pacchetti aggiuntivi come ``rpcgen`` e ``texinfo``.

source: The ``Signed-off-by`` line must be written by you, and not the AI helper. As a reminder, when contributing a change, your ``Signed-off-by`` line is required and the stipulations in the `Developer's Statement of Origin 1.1 <https://developercertificate.org/>`__ still apply.
it_it: La riga ``Signed-off-by`` deve essere scritta da un umano e non dall'IA. Come promemoria, quando si contribuisce con una modifica, è richiesta la riga ``Signed-off-by`` e le disposizioni contenute nella `Developer's Statement of Origin 1.1 <https://developercertificate.org/>`__ rimangono valide.

source: The ``autoconf``, ``automake``, and ``libtool`` packages bring standardization. This class defines a set of tasks (e.g. ``configure``, ``compile`` and so forth) that work for all Autotooled packages. It should usually be enough to define a few standard variables and then simply ``inherit autotools``. These classes can also work with software that emulates Autotools. For more information, see the ":ref:`dev-manual/new-recipe:building an autotooled package`" section in the Yocto Project Development Tasks Manual.
it_it: I pacchetti ``autoconf``, ``automake`` e ``libtool`` introducono la standardizzazione. Questa classe definisce un insieme di task (ad esempio ``configure``, ``compile`` e così via) che funzionano per tutti i pacchetti creati con Autotools. Di solito è sufficiente definire alcune variabili standard e poi semplicemente ``ereditare autotools``. Queste classi possono funzionare anche con software che emula Autotools. Per ulteriori informazioni, consultare la sezione ":ref:`dev-manual/new-recipe:building an autotooled package`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: The ``available_tracers`` file lists the set of available tracers::
it_it: Il file``available_tracers`` elenca l'insieme dei tracer disponibili::

source: The ``bitbake-layers create-layer`` script automates creating a BSP layer. What makes a layer a "BSP layer" is the presence of at least one machine configuration file. Additionally, a BSP layer usually has a kernel recipe or an append file that leverages off an existing kernel recipe. The primary requirement, however, is the machine configuration.
it_it: Lo script ``bitbake-layers create-layer`` automatizza la creazione di un layer BSP. Un layer BSP è definito tale dalla presenza di almeno un file di configurazione della macchina. Inoltre, un layer BSP solitamente include una ricetta del kernel o un file di append che sfrutta una ricetta del kernel esistente. Il requisito principale, tuttavia, è la configurazione della macchina.

source: The ``bitbake-setup`` tool is developed and maintained in :term:`BitBake` repository, and so can be used directly from there:
it_it: Il tool ``bitbake-setup`` è sviluppato e gestito nel repository di :term:`BitBake`, quindi può essere utilizzato direttamente da lì:

source: The ``bldcontrol/management/commands/checksettings.py`` file controls workflow configuration. Here is the process to initially populate this database.
it_it: Il file ``bldcontrol/management/commands/checksettings.py`` controlla la configurazione del workflow [flusso di lavoro]. Ecco la procedura per popolare inizialmente questo database.

source: The ``build/tmp/sysroots/`` directory can still be populated using the ``bitbake build-sysroots`` command and can be used for compatibility in some cases. However, in general it is not recommended to populate this directory. Individual recipe-specific sysroots should be used.
it_it: È comunque possibile popolare la directory ``build/tmp/sysroots/`` utilizzando il comando ``bitbake build-sysroots`` e, in alcuni casi, può essere utilizzata per garantire la compatibilità. Tuttavia, in generale, non è consigliabile popolare questa directory. È preferibile utilizzare directory sysroot specifiche per ogni ricetta.

source: The ``builddelete`` command deletes data associated with a build. Access the command as follows:
it_it: Il comando ``builddelete`` elimina i dati associati a una build. Per accedervi, procedere come segue:

source: The ``buildslist`` command lists all builds that Toaster has recorded. Access the command as follows:
it_it: Il comando ``buildslist`` elenca tutte le build registrate da Toaster. Per accedervi, procedere come segue:

source: The ``checksettings`` command verifies existing Toaster settings. Access the command as follows:
it_it: Il comando ``checksettings`` verifica le impostazioni di Toaster esistenti. È possibile accedervi nel seguente modo:

source: The ``conf/layer.conf`` file identifies the file structure as a layer, identifies the contents of the layer, and contains information about how the build system should use it. Generally, a standard boilerplate file such as the following works. In the following example, you would replace "bsp" with the actual name of the BSP (i.e. "bsp_root_name" from the example template). ::
it_it: Il file ``conf/layer.conf`` identifica la struttura dei file come layer, ne specifica il contenuto e contiene informazioni su come il sistema di build deve utilizzarlo. In genere, un file boilerplate standard come il seguente funziona. Nell'esempio seguente, è necessario sostituire "bsp" con il nome effettivo del BSP (ad esempio, "bsp_root_name" dal modello dell'esempio). ::

source: The ``current_tracer`` file contains the tracer currently in effect::
it_it: Il file ``current_tracer`` contiene il tracer attualmente attivo::

source: The ``devtool`` command employs a number of sub-commands that allow you to add, modify, and upgrade recipes. As with the OpenEmbedded build system, "recipes" represent software packages within ``devtool``. When you use ``devtool add``, a recipe is automatically created. When you use ``devtool modify``, the specified existing recipe is used in order to determine where to get the source code and how to patch it. In both cases, an environment is set up so that when you build the recipe a source tree that is under your control is used in order to allow you to make changes to the source as desired. By default, both new recipes and the source go into a "workspace" directory under the eSDK. The ``devtool upgrade`` command updates an existing recipe so that you can build it for an updated set of source files.
it_it: Il comando ``devtool`` utilizza una serie di sottocomandi che consentono di aggiungere, modificare e aggiornare le ricette. Come nel sistema di build OpenEmbedded, le "ricette" rappresentano pacchetti software all'interno di ``devtool``. Quando si utilizza ``devtool add``, viene creata automaticamente una ricetta. Quando si utilizza ``devtool modify``, viene utilizzata la ricetta esistente specificata per determinare dove reperire il codice sorgente e come applicarvi le patch. In entrambi i casi, viene configurato un ambiente in modo che, durante la compilazione della ricetta, venga utilizzato un albero dei sorgenti sotto il proprio controllo, consentendo di apportare modifiche al codice sorgente a piacimento. Per default, sia le nuove ricette che il codice sorgente vengono inseriti in una directory "workspace" all'interno dell'eSDK. Il comando ``devtool upgrade`` aggiorna una ricetta esistente in modo da poterla compilare con un set aggiornato di file sorgente.

source: The ``do_deploy[cleandirs] = "${DEPLOYDIR}"`` line creates the *empty* directory ``${DEPLOYDIR}`` before the :ref:`ref-tasks-deploy` task runs. (If the directory already exists, it is deleted and recreated empty.) For more information, see the ":ref:`bitbake-user-manual/bitbake-user-manual-metadata:variable flags`" section in the BitBake User Manual.
it_it: La riga ``do_deploy[cleandirs] = "${DEPLOYDIR}"`` crea la directory *vuota* ``${DEPLOYDIR}`` prima dell'esecuzione del task :ref:`ref-tasks-deploy`. (Se la directory esiste già, viene eliminata e ricreata vuota.) Per ulteriori informazioni, consultare la sezione ":ref:`bitbake-user-manual/bitbake-user-manual-metadata:variable flags`" nel Manuale Utente di BitBake.

source: The ``do_deploy[dirs] = "${B}"`` line creates the directory ``${B}`` before the :ref:`ref-tasks-deploy` task runs, and also sets the current working directory of :ref:`ref-tasks-deploy` to ``${B}``. (If the directory already exists, it is left as is.) For more information, see the ":ref:`bitbake-user-manual/bitbake-user-manual-metadata:variable flags`" section in the BitBake User Manual.
it_it: La riga ``do_deploy[dirs] = "${B}"`` crea la directory ``${B}`` prima dell'esecuzione del task :ref:`ref-tasks-deploy` e imposta anche la directory di lavoro corrente di :ref:`ref-tasks-deploy` a ``${B}``. (Se la directory esiste già, viene lasciata invariata.) Per ulteriori informazioni, consultare la sezione ":ref:`bitbake-user-manual/bitbake-user-manual-metadata:variable flags`" nel Manuale Utente di BitBake.

source: The ``do_deploy[sstate-inputdirs] = "${DEPLOYDIR}"`` declares that :ref:`ref-tasks-deploy` places its output in ``${DEPLOYDIR}`` when run normally (i.e. when not using the sstate cache). This output becomes the input to the shared state cache.
it_it: La riga ``do_deploy[sstate-inputdirs] = "${DEPLOYDIR}"`` dichiara che :ref:`ref-tasks-deploy`, quando viene eseguito normalmente (ovvero senza utilizzare la cache sstate), posiziona il suo output in ``${DEPLOYDIR}``. Questo output diventa l'input per la cache dello shared state.

source: The ``do_deploy[sstate-outputdirs] = "${DEPLOY_DIR_IMAGE}"`` line causes the contents of the shared state cache to be copied to ``${DEPLOY_DIR_IMAGE}``.
it_it: La riga ``do_deploy[sstate-outputdirs] = "${DEPLOY_DIR_IMAGE}"`` fa sì che il contenuto della cache dello stato condiviso venga copiato in ``${DEPLOY_DIR_IMAGE}``.

source: The ``do_deploy[stamp-extra-info] = "${MACHINE_ARCH}"`` line appends extra metadata to the :ref:`stamp file <overview-manual/concepts:stamp files and the rerunning of tasks>`. In this case, the metadata makes the task specific to a machine's architecture. See the ":ref:`bitbake-user-manual/bitbake-user-manual-execution:the task list`" section in the BitBake User Manual for more information on the ``stamp-extra-info`` flag.
it_it: La riga ``do_deploy[stamp-extra-info] = "${MACHINE_ARCH}"`` aggiunge metadati extra al file :ref:`stamp file <overview-manual/concepts:stamp files and the rerunning of tasks>`. In questo caso, i metadati rendono il task specifico per l'architettura di una macchina. Consultare la sezione ":ref:`bitbake-user-manual/bitbake-user-manual-execution:the task list`" nel Manuale Utente di BitBake per ulteriori informazioni sul flag ``stamp-extra-info``.

source: The ``enable`` file in the tracepoint directory is what allows the user (or tools such as ``trace-cmd``) to actually turn the tracepoint on and off. When enabled, the corresponding tracepoint will start appearing in the ftrace ``trace`` file described previously. For example, this turns on the ``kmalloc`` tracepoint::
it_it: Il file ``enable`` nella directory del tracepoint è ciò che consente all'utente (o a strumenti come ``trace-cmd``) di attivare e disattivare il tracepoint. Quando è abilitato, il tracepoint corrispondente inizierà ad apparire nel file ``trace`` di ftrace descritto in precedenza. Ad esempio, questo comando attiva il tracepoint ``kmalloc``::

source: The ``format`` file for the tracepoint describes the event in memory, which is used by the various tracing tools that now make use of these tracepoint to parse the event and make sense of it, along with a ``print fmt`` field that allows tools like ftrace to display the event as text. The format of the ``kmalloc`` event looks like::
it_it: Il file ``format`` per il tracepoint descrive l'evento in memoria, che viene utilizzato dai vari strumenti di tracing che ora si avvalgono di questi tracepoint per analizzare l'evento e interpretarlo, insieme a un campo ``print fmt`` che consente a strumenti come ftrace di visualizzare l'evento come testo. Il formato dell'evento ``kmalloc`` è il seguente::

source: The ``git send-email`` command can send email by using a local or remote Mail Transport Agent (MTA) such as ``msmtp``, ``sendmail``, or through a direct SMTP configuration in your Git ``~/.gitconfig`` file.
it_it: Il comando ``git send-email`` può inviare email utilizzando un Mail Transport Agent (MTA) locale o remoto, come ``msmtp``, ``sendmail``, oppure tramite una configurazione SMTP diretta nel file ``~/.gitconfig`` di Git.

source: The ``hello`` test program isn't installed on the root filesystem by the ``lttng-ust`` build, so we need to copy it over manually. First ``cd`` into the build directory that contains the ``hello`` executable::
it_it: Il programma di test ``hello`` non viene installato sul filesystem di root dalla build ``lttng-ust``, quindi dobbiamo copiarlo manualmente. Per prima cosa, ci si sposta nella directory di build che contiene l'eseguibile ``hello``::

source: The ``init`` command creates a new :term:`bitbake:Setup` in the :term:`bitbake:top directory`. The default name is derived from the selected configuration above.
it_it: Il comando ``init`` crea un nuovo :term:`bitbake:Setup` nella :term:`bitbake:top directory`. Il nome di default deriva dalla configurazione selezionata in precedenza.

source: The ``install-buildtools`` script is the easiest of the three methods by which you can get these tools. It downloads a pre-built :term:`buildtools` installer and automatically installs the tools for you:
it_it: Lo script ``install-buildtools`` è il più semplice dei tre metodi per ottenere questi strumenti. Scaricare un programma di installazione precompilato di :term:`buildtools` e installare automaticamente gli strumenti:

source: The ``makecache`` command consumes additional Metadata from ``epel-release``.
it_it: Il comando ``makecache`` utilizza Metadati aggiuntivi da ``epel-release``.

source: The ``meta-yocto-bsp/recipes-kernel/linux`` directory in the layer contains metadata used to build the kernel. In this case, a kernel append file (i.e. ``linux-yocto_6.18.bbappend``) is used to override an established kernel recipe (i.e. ``linux-yocto_6.18.bb``), which is located in :oe_git:`/openembedded-core/tree/meta/recipes-kernel/linux`.
it_it: La directory ``meta-yocto-bsp/recipes-kernel/linux`` nel layer contiene i metadati utilizzati per la compilazione del kernel. In questo caso, viene utilizzato un file di append del kernel (ad esempio ``linux-yocto_6.18.bbappend``) per sovrascrivere una ricetta del kernel esistente (ad esempio ``linux-yocto_6.18.bb``), che si trova in :oe_git:`/openembedded-core/tree/meta/recipes-kernel/linux`.
